<!-- dflook/terraform-github-actions {"workspace":"ephemeral","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"a1d87a8c4783a991e9c2665d59253b24e0fb68cb6f9f1e3f8d63838ba7a06641","plan_job_ref":"Job Test actions using target and replace #449 at https://github.com/dflook/terraform-github-actions/actions/runs/12750796493","plan_hash":"95c3e9341f17dd132a1e5b9f80d1a76d59692e2c640463e36bceeedbcf87e054","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __ephemeral__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "FMA4QePYMM" -> (known after apply)
!~  foreach = "cOZMiBu3EL" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #449](https://github.com/dflook/terraform-github-actions/actions/runs/12750796493)